# DSC 107

In [2]:
import numpy as np
import pandas as pd

In [3]:
student={"Name":["Sola","Bimbo","Abbey","Adura","Solomon","Aanu","Blessing","Peace","Success","Bolanle"],
         "Relationship Status":["Single","Divorced","Married","Married","Single","Single","Divorced","Married","Married","Single"],
         "Age":[23,28,29,32,18,21,27,30,24,22],
         "Department":["Agric. sci","Political sci","Law","Botany","Music","Accounting","Dramatic Art","Religion studies","Microbiology","Geology"]}

In [4]:
student

{'Name': ['Sola',
  'Bimbo',
  'Abbey',
  'Adura',
  'Solomon',
  'Aanu',
  'Blessing',
  'Peace',
  'Success',
  'Bolanle'],
 'Relationship Status': ['Single',
  'Divorced',
  'Married',
  'Married',
  'Single',
  'Single',
  'Divorced',
  'Married',
  'Married',
  'Single'],
 'Age': [23, 28, 29, 32, 18, 21, 27, 30, 24, 22],
 'Department': ['Agric. sci',
  'Political sci',
  'Law',
  'Botany',
  'Music',
  'Accounting',
  'Dramatic Art',
  'Religion studies',
  'Microbiology',
  'Geology']}

In [5]:
student["CGPA"]=[2.3,4.5,3.4,2.2,4.5,3.1,4.0,3.6,4.3,4.4]
student

{'Name': ['Sola',
  'Bimbo',
  'Abbey',
  'Adura',
  'Solomon',
  'Aanu',
  'Blessing',
  'Peace',
  'Success',
  'Bolanle'],
 'Relationship Status': ['Single',
  'Divorced',
  'Married',
  'Married',
  'Single',
  'Single',
  'Divorced',
  'Married',
  'Married',
  'Single'],
 'Age': [23, 28, 29, 32, 18, 21, 27, 30, 24, 22],
 'Department': ['Agric. sci',
  'Political sci',
  'Law',
  'Botany',
  'Music',
  'Accounting',
  'Dramatic Art',
  'Religion studies',
  'Microbiology',
  'Geology'],
 'CGPA': [2.3, 4.5, 3.4, 2.2, 4.5, 3.1, 4.0, 3.6, 4.3, 4.4]}

In [6]:
student.pop("Relationship Status")

['Single',
 'Divorced',
 'Married',
 'Married',
 'Single',
 'Single',
 'Divorced',
 'Married',
 'Married',
 'Single']

In [7]:
student

{'Name': ['Sola',
  'Bimbo',
  'Abbey',
  'Adura',
  'Solomon',
  'Aanu',
  'Blessing',
  'Peace',
  'Success',
  'Bolanle'],
 'Age': [23, 28, 29, 32, 18, 21, 27, 30, 24, 22],
 'Department': ['Agric. sci',
  'Political sci',
  'Law',
  'Botany',
  'Music',
  'Accounting',
  'Dramatic Art',
  'Religion studies',
  'Microbiology',
  'Geology'],
 'CGPA': [2.3, 4.5, 3.4, 2.2, 4.5, 3.1, 4.0, 3.6, 4.3, 4.4]}

In [8]:
df=pd.DataFrame(student)
df

       Name  Age        Department  CGPA
0      Sola   23        Agric. sci   2.3
1     Bimbo   28     Political sci   4.5
2     Abbey   29               Law   3.4
3     Adura   32            Botany   2.2
4   Solomon   18             Music   4.5
5      Aanu   21        Accounting   3.1
6  Blessing   27      Dramatic Art   4.0
7     Peace   30  Religion studies   3.6
8   Success   24      Microbiology   4.3
9   Bolanle   22           Geology   4.4

In [9]:
df["Admission_Date"]=["2013-12-03","2020-11-05","2012-09-06","2021-10-12","2017-11-03","2012-11-01","2010-06-03","2015-11-02","2014-04-07","2019-03-01"]

In [10]:
df["Gender"]=["Male","Female","Male","Male","Male","Female","Female","Male","Male","Female"]

In [11]:
df

       Name  Age        Department  CGPA Admission_Date  Gender
0      Sola   23        Agric. sci   2.3     2013-12-03    Male
1     Bimbo   28     Political sci   4.5     2020-11-05  Female
2     Abbey   29               Law   3.4     2012-09-06    Male
3     Adura   32            Botany   2.2     2021-10-12    Male
4   Solomon   18             Music   4.5     2017-11-03    Male
5      Aanu   21        Accounting   3.1     2012-11-01  Female
6  Blessing   27      Dramatic Art   4.0     2010-06-03  Female
7     Peace   30  Religion studies   3.6     2015-11-02    Male
8   Success   24      Microbiology   4.3     2014-04-07    Male
9   Bolanle   22           Geology   4.4     2019-03-01  Female

In [12]:
name=["Sola","Bimbo","Abbey","Adura","Solomon","Aanu","Blessing","Peace","Success","Bolanle"]
relationship=["Single","Divorced","Married","Married","Single","Single","Divorced","Married","Married","Single"]
age=[23,28,29,32,18,21,27,30,24,22]
department=["Agric. sci","Political sci","Law","Botany","Music","Accounting","Dramatic Art","Religion studies","Microbiology","Geology"]
admission_Date=["2013-12-03","2020-14-05","2012-24-06","2021-10-12","2017-11-03","2012-11-01","2010-25-03","2015-19-02","2014-26-07","2019-14-01"]
gender=["Male","Female","Male","Male","Male","Female","Female","Male","Male","Female"]
cgpa=[2.3,4.5,3.4,2.2,4.5,3.1,4.0,3.6,4.3,4.4]
df2=pd.DataFrame({"NAME":name,"RELATIONSHIP STAUS":relationship,"AGE":age,"DEPARTMENT":department,"CGPA":cgpa,"ADMISSION_DATE":admission_Date,"GENDER":gender,})
df2

,NAME,RELATIONSHIP STAUS,AGE,DEPARTMENT,CGPA,ADMISSION_DATE,GENDER
0,Sola,Single,23,Agric. sci,2.3,2013-12-03,Male
1,Bimbo,Divorced,28,Political sci,4.5,2020-14-05,Female
2,Abbey,Married,29,Law,3.4,2012-24-06,Male
3,Adura,Married,32,Botany,2.2,2021-10-12,Male
4,Solomon,Single,18,Music,4.5,2017-11-03,Male
5,Aanu,Single,21,Accounting,3.1,2012-11-01,Female
6,Blessing,Divorced,27,Dramatic Art,4.0,2010-25-03,Female
7,Peace,Married,30,Religion studies,3.6,2015-19-02,Male
8,Success,Married,24,Microbiology,4.3,2014-26-07,Male
9,Bolanle,Single,22,Geology,4.4,2019-14-01,Female

In [22]:
df["Admission_Date"]=pd.to_datetime(df["Admission_Date"])
df['Year']=df["Admission_Date"].dt.year
df['Month']=df["Admission_Date"].dt.month
df['day']=df["Admission_Date"].dt.day

In [23]:
df

,Name,Age,Department,CGPA,Admission_Date,Gender,Year,Month,day
0,Sola,23,Agric. sci,2.3,2013-12-03,Male,2013,12,3
1,Bimbo,28,Political sci,4.5,2020-11-05,Female,2020,11,5
2,Abbey,29,Law,3.4,2012-09-06,Male,2012,9,6
3,Adura,32,Botany,2.2,2021-10-12,Male,2021,10,12
4,Solomon,18,Music,4.5,2017-11-03,Male,2017,11,3
5,Aanu,21,Accounting,3.1,2012-11-01,Female,2012,11,1
6,Blessing,27,Dramatic Art,4.0,2010-06-03,Female,2010,6,3
7,Peace,30,Religion studies,3.6,2015-11-02,Male,2015,11,2
8,Success,24,Microbiology,4.3,2014-04-07,Male,2014,4,7
9,Bolanle,22,Geology,4.4,2019-03-01,Female,2019,3,1

In [33]:
df.dtypes

Name                      object
Age                        int64
Department                object
CGPA                     float64
Admission_Date    datetime64[ns]
Gender                    object
Year                       int64
Month                      int64
day                        int64
dtype: object

In [63]:
##checking the missing value
df.isnull().sum()

Name              0
Age               0
Department        0
CGPA              0
Admission_Date    0
Gender            0
Year              0
Month             0
day               0
dtype: int64

In [13]:
##% of missing value
df.isnull().sum()/df.shape[0]*100

Name              0.0
Age               0.0
Department        0.0
CGPA              0.0
Admission_Date    0.0
Gender            0.0
dtype: float64

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            10 non-null     object
 1   Age             10 non-null     int64
 2   Department      10 non-null     object
 3   CGPA            10 non-null     float64
 4   Admission_Date  10 non-null     datetime64[ns]
 5   Gender          10 non-null     object
 6   Year            10 non-null     int64
 7   Month           10 non-null     int64
 8   day             10 non-null     int64
dtypes: datetime64[ns](1), float64(1), int64(4), object(3)
memory usage: 848.0+ bytes

In [55]:
df.describe()

             Age       CGPA         Year      Month        day
count  10.000000  10.000000    10.000000  10.000000  10.000000
mean   25.400000   3.630000  2015.300000   8.800000   4.300000
std     4.477102   0.871844     3.772709   3.259175   3.368151
min    18.000000   2.200000  2010.000000   3.000000   1.000000
25%    22.250000   3.175000  2012.250000   6.750000   2.250000
50%    25.500000   3.800000  2014.500000  10.500000   3.000000
75%    28.750000   4.375000  2018.500000  11.000000   5.750000
max    32.000000   4.500000  2021.000000  12.000000  12.000000

In [58]:
df.shape

(10, 9)

In [15]:
##subset for male gender
df2.query("GENDER == 'Male'")

,NAME,RELATIONSHIP STAUS,AGE,DEPARTMENT,CGPA,ADMISSION_DATE,GENDER
0,Sola,Single,23,Agric. sci,2.3,2013-12-03,Male
2,Abbey,Married,29,Law,3.4,2012-24-06,Male
3,Adura,Married,32,Botany,2.2,2021-10-12,Male
4,Solomon,Single,18,Music,4.5,2017-11-03,Male
7,Peace,Married,30,Religion studies,3.6,2015-19-02,Male
8,Success,Married,24,Microbiology,4.3,2014-26-07,Male

In [39]:
df["CGPA"].mean()

3.6300000000000003

In [40]:
df["CGPA"].max()

4.5

In [41]:
df["CGPA"].min()

2.2

In [42]:
df["CGPA"].sum()

36.3

In [17]:
df.to_csv("Project1.csv", index=False)